In [1]:
import pandas as pd

In [2]:
dfa = pd.read_csv("data.csv")
dfb = pd.read_csv("no_column_data.csv")

In [3]:
dfa

   id name  age
0  22   gg   66
1  44   jj   12
2  30   hh   23
3  83   ti   29

In [4]:
dfb

   id name place
0  22   gg    tt
1  44   jj    io
2  30   hh    ui
3  83   ti    rr

In [5]:
pd.merge(dfa, dfb)

   id name  age place
0  22   gg   66    tt
1  44   jj   12    io
2  30   hh   23    ui
3  83   ti   29    rr

In [7]:
pd.merge(dfa, dfb, on = "name")

   id_x name  age  id_y place
0    22   gg   66    22    tt
1    44   jj   12    44    io
2    30   hh   23    30    ui
3    83   ti   29    83    rr